In [15]:
"""
Create table Items(
id				int,
order_id       int,
product_id   int,
quantity        int,
total_price         money
)

"""

'\nCreate table Items(\nid\t\t\t\tint,\norder_id       int,\nproduct_id   int,\nquantity        int,\ntotal_price         money\n)\n\n'

In [16]:

import pandas as pd
import pyodbc 

server = 'LETICIA' # Substitua pelo nome do servidor SQL Server
database = 'Python'  # Substitua pelo nome do banco de dados
conexaoDB = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};'
                      f'SERVER={server};'
                      f'DATABASE={database};'
                      'Trusted_Connection=yes;')

cursor = conexaoDB.cursor()   # criando cursor de comando

In [17]:
dados = pd.read_excel(r"C:\Users\Leticia\Desktop\Python-Banco de Dados\Banco de dados\Origem\arquivos_excel\items.xlsx")
#str(dados.columns).replace("'","") 
#dados.head(5)

In [18]:
cursor = conexaoDB.cursor()   # criando cursor de comando

In [19]:
dados

          id  order_id  product_id  quantity  total_price
0          0      7019          28         1          186
1          1      8827          29         1          110
2          2      3863          38         1          385
3          3      5002          37         1          493
4          4      6337          28         1          186
...      ...       ...         ...       ...          ...
49995  49995      8891           1         2           42
49996  49996       579          12         5         9960
49997  49997      8589          30         4          440
49998  49998      2311          12         1         1992
49999  49999      1401          30         1          110

[50000 rows x 5 columns]

In [20]:
#apagar somente uma coluna no python
#cursor.execute("ALTER TABLE nome_da_tabela DROP COLUMN nome_da_coluna")
#cursor.commit()

In [21]:
#Para apagar somente uma linha em Python de uma tabela de banco de dados, você pode usar uma instrução SQL DELETE 
# combinada com uma condição WHERE para identificar a linha a ser apagada. Veja um exemplo abaixo:
#cursor.execute("DELETE FROM nome_da_tabela WHERE condição_para_identificar_a_linha")
#cursor.commit()
#tenho que olhar dentro do banco para verificar!
#cursor.execute("DELETE FROM items WHERE id = 158")
#cursor.commit()

In [22]:
#dados

In [23]:
#cursor.execute('delete from [Items]')   #executa tarefa de  apagar dados 
#cursor.commit()

In [24]:
#dados

In [25]:
#str(dados.columns).replace("'","")  # coluna de origem somente ver as colunas

In [26]:
str(dados.columns).replace("'","")  # coluna de origem

'Index([id, order_id, product_id, quantity, total_price], dtype=object)'

In [27]:
#dados.head(5)

In [28]:
#print(dados['id'].dtype)
#print(dados['total_price'].dtype)

In [29]:
dados['total_price'] = dados['total_price'].astype(float)

In [30]:
#inserção no banco de dados 
for index, linha in dados.iterrows():
    
    cursor.execute("Insert into [Items](id,order_id,product_id,quantity,total_price)values(?,?,?,?,?)",linha.id,linha.order_id,linha.product_id,linha.quantity,linha.total_price) 
     # inserir colunas e quantas colunas tiver passar quantidade de ??
cursor.commit()   # validar dados no SQL Server
cursor.close()    #Fechar Cursor
conexaoDB.close() #Fechar Conexao

In [ ]:
import pandas as pd
import pyodbc 

server = 'LETICIA' # Substitua pelo nome do servidor SQL Server
database = 'Python'  # Substitua pelo nome do banco de dados
conexaoDB = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};'
                      f'SERVER={server};'
                      f'DATABASE={database};'
                      'Trusted_Connection=yes;')

cursor = conexaoDB.cursor()   # criando cursor de comando 
dados = pd.read_excel(r"C:\Users\Leticia\Desktop\Python-Banco de Dados\Banco de dados\Origem\arquivos_excel\items.xlsx")

dados.head

str(dados.columns).replace("'","")  # coluna de origem 




dados['total_price'] = dados['total_price'].astype(float)

#inserção no banco de dados 
for index, linha in dados.iterrows():
    
    cursor.execute("Insert into [Items](id,order_id,product_id,quantity,total_price)values(?,?,?,?,?)",linha.id,linha.order_id,linha.product_id,linha.quantity,linha.total_price) 
     # inserir colunas e quantas colunas tiver passar quantidade de ??
cursor.commit()   # validar dados no SQL Server
cursor.close()    #Fechar Cursor
conexaoDB.close() #Fechar Conexao